"""
Дробная часть

Дано положительное действительное число. Выведите его дробную часть.

Формат входных данных
На вход программе подается положительное действительное число.

Формат выходных данных
Программа должна вывести дробную часть числа в соответствии с условием задачи.

https://stepik.org/lesson/265105/step/9?unit=246053
"""

print(float(input()) % 1)
