"""
Делители-1 🌶️
На вход программе подается два натуральных числа a и b (a< b). Напишите программу, которая находит натуральное число из
отрезка [a;b] с максимальной суммой делителей.

Формат входных данных
На вход программе подаются два числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести два числа на одной строке, разделенных пробелом: число с максимальной суммой делителей и сумму
его делителей.

Примечание. Если таких чисел несколько, то выведите наибольшее из них.

https://stepik.org/lesson/298796/step/3?auth=login&unit=280623
"""
a, b = int(input()), int(input())

total_divider = 0
max_divider = 0
counter = 0

for i in range(a, b + 1):
    for j in range(1, i + 1):
        if i % j == 0:
            counter += j
    if counter >= total_divider:
        total_divider = counter
        max_divider = i
    counter = 0

print(max_divider, total_divider)