"""
Python is awesome
Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.

Формат входных данных

Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

https://stepik.org/lesson/265118/step/2?unit=246067
"""

for i in range(10):
    print('Python is awesome')