"""
Две половинки
На вход программе подается строка текста. Напишите программу, которая разрежет ее на две равные части,
переставит их местами и выведет на экран.

Формат входных данных
На вход программе подается строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Если длина строки нечетная, то длина первой части должна быть на один символ больше.

https://stepik.org/lesson/302627/step/13?unit=284520
"""

s = 'abcdef'

print(s[len(s)//2 + len(s)%2:] + s[:len(s)//2 + len(s)%2])
