"""
Напишите программу, которая принимает на вход два целых числа в одну строку и выводит на экран их сумму.

https://stepik.org/lesson/295797/step/5?unit=277501
"""
a, b = map(int, input().split())
print(a + b)
