"""
На год старше
Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет ему
исполнится в следующем году

https://stepik.org/lesson/295797/step/4?unit=277501
"""

print(int(input())+1)